In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
gdp_df = pd.read_csv('../data/gdp_per_capita.csv.csv')

In [3]:
gdp_df

,Country or Area,Year,Value,Value Footnotes
0,Afghanistan,2019,2065.036398,NaN
1,Afghanistan,2018,2033.779002,NaN
2,Afghanistan,2017,2058.383832,NaN
3,Afghanistan,2016,2057.062164,NaN
4,Afghanistan,2015,2068.265904,NaN
...,...,...,...,...
6865,Zimbabwe,1992,3054.889178,NaN
6866,Zimbabwe,1991,3426.598094,NaN
6867,Zimbabwe,1990,3324.348171,NaN
6868,footnoteSeqID,Footnote,NaN,NaN
6869,2,"Excludes South Sudan after July 9, 2011.",NaN,NaN

In [4]:
gdp_df[0:11]

   Country or Area  Year        Value  Value Footnotes
0      Afghanistan  2019  2065.036398              NaN
1      Afghanistan  2018  2033.779002              NaN
2      Afghanistan  2017  2058.383832              NaN
3      Afghanistan  2016  2057.062164              NaN
4      Afghanistan  2015  2068.265904              NaN
5      Afghanistan  2014  2102.385234              NaN
6      Afghanistan  2013  2116.465454              NaN
7      Afghanistan  2012  2075.491747              NaN
8      Afghanistan  2011  1904.559799              NaN
9      Afghanistan  2010  1957.029338              NaN
10     Afghanistan  2009  1758.904043              NaN

In [5]:
gdp_df[-5:]

,Country or Area,Year,Value,Value Footnotes
6865,Zimbabwe,1992,3054.889178,NaN
6866,Zimbabwe,1991,3426.598094,NaN
6867,Zimbabwe,1990,3324.348171,NaN
6868,footnoteSeqID,Footnote,NaN,NaN
6869,2,"Excludes South Sudan after July 9, 2011.",NaN,NaN

In [6]:
gdp_df = gdp_df.drop(columns = "Value Footnotes", axis=1)

In [8]:
gdp_df = gdp_df.rename(columns = {'Country or Area':'Country', 'Year':'Year', 'Value': 'GDP_Per_Capita'})

In [9]:
gdp_df

            Country                                      Year  GDP_Per_Capita
0       Afghanistan                                      2019     2065.036398
1       Afghanistan                                      2018     2033.779002
2       Afghanistan                                      2017     2058.383832
3       Afghanistan                                      2016     2057.062164
4       Afghanistan                                      2015     2068.265904
...             ...                                       ...             ...
6865       Zimbabwe                                      1992     3054.889178
6866       Zimbabwe                                      1991     3426.598094
6867       Zimbabwe                                      1990     3324.348171
6868  footnoteSeqID                                  Footnote             NaN
6869              2  Excludes South Sudan after July 9, 2011.             NaN

[6870 rows x 3 columns]

In [4]:
gdp_2014 = pd.DataFrame(gdp_df['Year'==2014])

NameError: name 'pd' is not defined